import { Component, OnInit } from '@angular/core';
import { TablesService } from '../tables.service';

@Component({
  selector: 'app-blockers-dashboard',
  templateUrl: './blockers-dashboard.component.html',
  styleUrls: ['./blockers-dashboard.component.css']
})
export class BlockersDashboardComponent implements OnInit {
  chart1:Array<any>;
  chart2:Array<any>;

  constructor(private tableService: TablesService) { }

  ngOnInit() {
/*     this.tableService.getFiles().subscribe(
      data => {
        this.chart1 = this.tableService.blockersChart1(data)
      }
    ) */
    this.chart1 = DATA;
  }

}

const DATA = [{
  "field": "תחומי רוחב",
  "4. מתעכב מול תכנון מקורי": 60,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 27,
  "1. בוצע כמתוכנן במקור": 32,
  "5. בוטל": 26,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 6,
  "6. מבוצע בשוטף": 6
}, {
  "field": "בריאות",
  "5. בוטל": 17,
  "1. בוצע כמתוכנן במקור": 15,
  "4. מתעכב מול תכנון מקורי": 35,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 12,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 12
}, {
  "field": "חינוך",
  "4. מתעכב מול תכנון מקורי": 7,
  "1. בוצע כמתוכנן במקור": 18,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 9,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 8,
  "5. בוטל": 4
}, {
  "field": "טרנספורמציה של שירותים",
  "1. בוצע כמתוכנן במקור": 7,
  "4. מתעכב מול תכנון מקורי": 15,
  "5. בוטל": 24,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 12
}, {
  "field": "כלכלה",
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 6,
  "4. מתעכב מול תכנון מקורי": 26,
  "1. בוצע כמתוכנן במקור": 10,
  "5. בוטל": 10,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 2,
  "3. יבוצע במועד העדכני, כפי שהוגדר במהלך השנה": 1
}, {
  "field": "מטה",
  "6. מבוצע בשוטף": 14,
  "5. בוטל": 15,
  "1. בוצע כמתוכנן במקור": 11,
  "4. מתעכב מול תכנון מקורי": 9,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 8
}, {
  "field": "משפטים",
  "1. בוצע כמתוכנן במקור": 3,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 4,
  "4. מתעכב מול תכנון מקורי": 12
}, {
  "field": "עבודה ורווחה",
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 5,
  "4. מתעכב מול תכנון מקורי": 21,
  "5. בוטל": 6,
  "1. בוצע כמתוכנן במקור": 1,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 1
}, {
  "field": "פיננסים",
  "4. מתעכב מול תכנון מקורי": 4
}, {
  "field": "שלטון מקומי",
  "1. בוצע כמתוכנן במקור": 9,
  "4. מתעכב מול תכנון מקורי": 37,
  "2. בוצע עם שינוי תכולה (מהות ו/או זמן)": 12,
  "5. בוטל": 5,
  "3. יבוצע בהמשך, בהתאם לתכנון המקורי": 1
}]